In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("personal_Finance_Dataset_processed.csv")

In [4]:
df.head()

,Date,Transaction Description,Category,Amount,Type
0,2020-01-02,Score each.,Food & Drink,1485.69,Expense
1,2020-01-02,Quality throughout.,Utilities,1475.58,Expense
2,2020-01-04,Instead ahead despite measure ago.,Rent,1185.08,Expense
3,2020-01-05,Information last everything thank serve.,Investment,2291.00,Income
4,2020-01-13,Future choice whatever from.,Food & Drink,1126.88,Expense

In [10]:
df.isnull().sum() #if all 0s perfect no missing data

Date                       0
Transaction Description    0
Category                   0
Amount                     0
Type                       0
dtype: int64

In [8]:
df["Date"]=pd.to_datetime(df["Date"])

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Date                     1500 non-null   datetime64[ns]
 1   Transaction Description  1500 non-null   object
 2   Category                 1500 non-null   object
 3   Amount                   1500 non-null   float64
 4   Type                     1500 non-null   object
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 58.7+ KB

In [11]:
df["Amount"]=df.apply(lambda row:-abs(row["Amount"]) if row ["Type"]=="Expense" else abs(row["Amount"]),axis=1)
#this will tell if the amount is - so it is an expense if + it is an income

In [12]:
df[["Type", "Amount"]].head()

      Type   Amount
0  Expense -1485.69
1  Expense -1475.58
2  Expense -1185.08
3   Income  2291.00
4  Expense -1126.88

In [13]:
df.duplicated().sum() #ra7 yetla3 ljaweb 0 so no duplicate rows

np.int64(0)

In [14]:
df["Amount"].describe()

count    1500.000000
mean     -328.738247
std      1602.339263
min     -1999.820000
25%     -1383.790000
50%      -781.060000
75%      -171.147500
max      4996.000000
Name: Amount, dtype: float64

In [15]:
Q1 = df["Amount"].quantile(0.25)
Q3 = df["Amount"].quantile(0.75)
IQR = Q3 - Q1

lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR

print("Lower limit:", lower_limit)
print("Upper limit:", upper_limit)

Lower limit: -3202.75375
Upper limit: 1647.8162499999999

In [16]:
outliers = ((df["Amount"] < lower_limit) | (df["Amount"] > upper_limit)).sum()
print("Number of outliers:", outliers)

Number of outliers: 201

In [17]:
# Cap (limit) outliers within the lower and upper limits
df["Amount"] = df["Amount"].clip(lower=lower_limit, upper=upper_limit)

# Let's confirm the new limits
df["Amount"].describe()

count    1500.000000
mean     -542.494869
std      1105.506621
min     -1999.820000
25%     -1383.790000
50%      -781.060000
75%      -171.147500
max      1647.816250
Name: Amount, dtype: float64

In [4]:
(df["Amount"]<lower_limit).sum(),
(df["Amount"]>upper_limit).sum()

NameError: name 'lower_limit' is not defined

In [5]:
Q1 = df["Amount"].quantile(0.25)
Q3 = df["Amount"].quantile(0.75)
IQR = Q3 - Q1

lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR

In [6]:
df["Amount"] = df["Amount"].clip(lower=lower_limit, upper=upper_limit)

In [7]:
(df["Amount"] < lower_limit).sum(), (df["Amount"] > upper_limit).sum()

(np.int64(0), np.int64(0))

In [8]:
df.isnull().sum()

Date                       0
Transaction Description    0
Category                   0
Amount                     0
Type                       0
dtype: int64

In [9]:
# Clean up text columns: strip spaces and standardize case
text_columns = ["Category", "Type", "Transaction Description"]

for col in text_columns:
    if col in df.columns:
        df[col] = df[col].astype(str).str.strip().str.lower()

df.head()

,Date,Transaction Description,Category,Amount,Type
0,2020-01-02,score each.,food & drink,1485.69,expense
1,2020-01-02,quality throughout.,utilities,1475.58,expense
2,2020-01-04,instead ahead despite measure ago.,rent,1185.08,expense
3,2020-01-05,information last everything thank serve.,investment,2291.00,income
4,2020-01-13,future choice whatever from.,food & drink,1126.88,expense

In [11]:
df.to_csv("Personal_Finance_Dataset_CLEANED.csv", index=False)
print(" Cleaned dataset saved successfully!")

 Cleaned dataset saved successfully!

In [12]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Date                     1500 non-null   object
 1   Transaction Description  1500 non-null   object
 2   Category                 1500 non-null   object
 3   Amount                   1500 non-null   float64
 4   Type                     1500 non-null   object
dtypes: float64(1), object(4)
memory usage: 58.7+ KB

,Date,Transaction Description,Category,Amount,Type
count,1500,1500,1500,1500.000000,1500
unique,1025,1500,10,NaN,2
top,2023-01-24,pressure activity defense detail.,rent,NaN,expense
freq,6,1,165,NaN,1222
mean,NaN,NaN,NaN,1261.189093,NaN
std,NaN,NaN,NaN,850.372478,NaN
min,NaN,NaN,NaN,14.370000,NaN
25%,NaN,NaN,NaN,629.340000,NaN
50%,NaN,NaN,NaN,1156.285000,NaN
75%,NaN,NaN,NaN,1712.932500,NaN
max,NaN,NaN,NaN,3338.321250,NaN